export const logStr = `
### v0.5 (2025.3.29)

#### 系统
- 接入微信小程序

#### 活动日历
- 新增了若干游戏奖励图标
- 优化了设置界面的布局
- 优化了活动状态的显示的图标
- 优化了按状态排序时的逻辑
- 优化了活动列表为空时的提示文字
- 修复了在微信小程序中，顶部周历的第一天为前天而非昨天的问题
- 修复了在微信小程序中，无法标记已完成的问题
- 修复了在微信小程序中，首次进入界面和设置确定后会刷新两次的问题

### v0.4 (2025.3.22)

#### 活动日历
- 优化了下拉刷新的区域和效果
- 优化了活动详情的滑动穿透
- 优化了剩余时间的计算逻辑
- 调整了设置按钮的位置和透明度
- 部分样式兼容了微信小程序

### v0.3 (2025.3.15)

#### 活动日历
- 新增游戏：《舞萌 DX》
- 优化了日历图片的缩放显示
- 优化了设置相关的显示，以适配微信小程序
- 优化了用户未选择游戏和活动列表为空时的显示

### v0.2 (2025.3.8)

#### 活动日历
- 新增下拉刷新
- 新增图片显示设置
- 优化了自动刷新逻辑
- 优化了未选择游戏时的显示逻辑

#### 我的
- 新增更新日志

### v0.1 (2025.3.1)

#### 活动日历
- 新增活动日历，可按状态、游戏、开始时间、结束时间排序，可按活动状态、完成状态过滤
- 新增游戏：《原神》《崩坏：星穹铁道》《绝区零》
`;
