export const logStr = `

### v0.9 (2025.5.10)

### 活动日历
- 新增游戏《明日方舟》
- 新增游戏图标
- 优化了游戏的选择方式
- 优化了活动日历设置的底部样式
- 调整了活动详情的高度

#### 我的
- 修改了《服务条款》和《隐私协议》的部分措辞

### v0.8 (2025.4.30)

### 活动日历
- 优化了活动详情的图片显示，现在显示多个图片

### v0.7 (2025.4.26)

#### 活动日历
- 新增游戏列表
- 优化了有多种活动奖励时的显示
- 移除了点击活动详情标题时的跳转

### v0.6 (2025.4.12)

#### 我的
- 接入微信登录
- 新增了关于界面
- 新增了《服务条款》和《隐私协议》

#### 活动日历
- 新增了若干游戏奖励图标
- 优化了活动详情的跳转


### v0.5 (2025.3.29)

#### 系统
- 接入微信小程序

#### 活动日历
- 新增了若干游戏奖励图标
- 优化了设置界面的布局
- 优化了活动状态的显示的图标
- 优化了按状态排序时的逻辑
- 优化了活动列表为空时的提示文字
- 修复了在微信小程序中，顶部周历的第一天为前天而非昨天的问题
- 修复了在微信小程序中，无法标记已完成的问题
- 修复了在微信小程序中，首次进入界面和设置确定后会刷新两次的问题

### v0.4 (2025.3.22)

#### 活动日历
- 优化了下拉刷新的区域和效果
- 优化了活动详情的滑动穿透
- 优化了剩余时间的计算逻辑
- 调整了设置按钮的位置和透明度
- 部分样式兼容了微信小程序

### v0.3 (2025.3.15)

#### 活动日历
- 新增游戏：《舞萌 DX》
- 优化了日历图片的缩放显示
- 优化了设置相关的显示，以适配微信小程序
- 优化了用户未选择游戏和活动列表为空时的显示

### v0.2 (2025.3.8)

#### 活动日历
- 新增下拉刷新
- 新增图片显示设置
- 优化了自动刷新逻辑
- 优化了未选择游戏时的显示逻辑

#### 我的
- 新增更新日志

### v0.1 (2025.3.1)

#### 活动日历
- 新增活动日历，可按状态、游戏、开始时间、结束时间排序，可按活动状态、完成状态过滤
- 新增游戏：《原神》《崩坏：星穹铁道》《绝区零》
`;
